"@MaddowBlog right now trump and his minions are secretly packing and the jet is being fueled #skippingtown\n""This would make more sense RUSSIA @trump2021 if the overlay face was either a Goat or a sheep but far more effectiv… https://t.co/IR7qquLr5o\n""Shit's about to get real... #TrumpRussia https://t.co/90ptRdJ0TK\n""@tonyposnanski @PrincessBravato Mike Pence simply wanted to ride in on the coattails of Trump and hope he gets out… https://t.co/4aOFJVLQkD\n""@TuckerCarlson doing my part to spread word of Trumps Greatness &amp; bad ole Muslims Dems never read u Got locked out of FB last nite😳🤓\n""If Trump does chose to resign-he'll do it with pardon deal in place and before he's charged. Also likely to throw in dementia diagnosis imo.\n""Some have forgotten this powerful beatdown of @realDonaldTrump by @MikeBloomberg at the DNC Convention. #NeverTruml  https://t.co/clW1trmu9K\n""Some have forgotten this powerful beatdown of @realDonaldTrump by @MikeBloomberg at the DNC Convention. #NeverTruml  https://t.co/EP0rIVN5no\n""@realDonaldTrump remember to keep your hands to yourself, ok?\n""@realDonaldTrump approval rating is at historical lows and he expects people to follow him. Worst leader / president in history.\n""@realDonaldTrump #lockhimup #America will only be great again when ur in jail. America was great until u came along\n""@realDonaldTrump THIS is not an example of women's \"full potential\" moron. You know squat about women, our history,… https://t.co/spsZTTCFsh\n""@realDonaldTrump Fantastic. Thank you for sharing Mr.President!\n""Hillary Comes Out of Hiding To Encourage Americans To Resist Trump https://t.co/qWYp6eNvHY Hillary Clinton is trying to destroy this country\n""#MakeAmericaGreatAgain why are people criticizing Melania Trump for staying behind so son can finish school year.  Really?  I get it Melania\n""@realDonaldTrump to screw us over on healthcare, employment and opportunity.\n""@KurtSchlichter Probably 500,000 people minimum, that would risk jail to bring to light any real evidence of Trump… https://t.co/f1b00LEzSj\n""@realDonaldTrump We are more than pretty faces, arranging pretty flowers, and hosting pretty parties.\n""@realDonaldTrump Five letter word for 'failure' in future crosswords.   T-R-U-M~P.\n""#Trump you are a liar, cheat, and engage in many forms of bad &amp; unethical behvr (at best) but you are King of ratings. #MAINSTREAMMEDIA\n""@realDonaldTrump @RepMarkMeadows @Jim_Jordan @Raul_Labrador Make some changes that are important to conservatives a… https://t.co/gDyyYzXJtY\n""Trump does not own this problem now. https://t.co/7LZ9Ws7c75\n""@realDonaldTrump Right! But vPotus broke the tie today and cut off the life support today for 100's of 1000's of wo… https://t.co/hZTucS2n5Y\n""@realDonaldTrump @RepKenBuck How about those Russia hearings today, Donnie? Looks like eventually truth will come o… https://t.co/zmZoteO5Kv\n""@POTUS uses Russian tactics against US citizens. When will the Trumpanzess stop being lemmings being led off a cliff?\n""About to spill the beans....\nTrump get your goons...\nYour right hand man about to do you… https://t.co/dtLs3lIKsR\n"